BEGIN;

CREATE TABLE employee (
    id serial PRIMARY KEY,
	name VARCHAR(255) NOT NULL,
    surname VARCHAR(255) NOT NULL,
    middle_name VARCHAR(255),
	birth_date DATE NOT NULL,
    email VARCHAR(100) UNIQUE,
	phone_number VARCHAR(20) UNIQUE NOT NULL
);

CREATE TABLE supplier (
    id serial PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    street VARCHAR(255) NOT NULL,
    house_number INTEGER NOT NULL,
    email VARCHAR(100) UNIQUE,
	phone_number VARCHAR(20) UNIQUE NOT NULL
);

CREATE TABLE client (
	id serial PRIMARY KEY,
	name VARCHAR(255) NOT NULL,
    surname VARCHAR(255) NOT NULL,
    middle_name VARCHAR(255),
    email VARCHAR(100) UNIQUE,
	phone_number VARCHAR(20) UNIQUE NOT NULL
);

CREATE TABLE shop (
	id serial PRIMARY KEY,
	city VARCHAR(255) NOT NULL,
    street VARCHAR(255) NOT NULL,
    house_number INTEGER NOT NULL,
	opening_date DATE NOT NULL,
    closing_date DATE
);

CREATE TABLE department (
	id serial PRIMARY KEY,
	name VARCHAR(255) NOT NULL,
    creation_date DATE NOT NULL
);

CREATE TABLE product (
    id serial PRIMARY KEY,
    name VARCHAR(255) NOT NULL
);

CREATE TABLE department_unit (
	id serial PRIMARY KEY,
    department_id INTEGER REFERENCES department NOT NULL,
	name VARCHAR(255) NOT NULL,
    creation_date DATE  NOT NULL
);

CREATE TABLE schedule_department_unit (
	id serial PRIMARY KEY,
	employee_id INTEGER REFERENCES employee NOT NULL,
    department_unit_id INTEGER REFERENCES department_unit NOT NULL,
    begin_workday TIMESTAMP NOT NULL,
    end_workday TIMESTAMP NOT NULL
);

CREATE TABLE schedule_shop (
	id serial PRIMARY KEY,
	employee_id INTEGER REFERENCES employee NOT NULL,
    shop_id INTEGER REFERENCES shop NOT NULL,
    begin_workday TIMESTAMP NOT NULL,
    end_workday TIMESTAMP NOT NULL
);

CREATE TABLE shipment (
    id serial PRIMARY KEY,
    shop_id INTEGER REFERENCES shop NOT NULL,
    product_id INTEGER REFERENCES product NOT NULL,
    employee_id INTEGER REFERENCES employee NOT NULL,
    supplier_id INTEGER REFERENCES supplier NOT NULL,
	price DECIMAL(8,2) NOT NULL,
    quantity INTEGER NOT NULL
);

CREATE TABLE buy (
	id serial PRIMARY KEY,
	client_id INTEGER REFERENCES client NOT NULL,
    shop_id INTEGER REFERENCES shop NOT NULL,
    product_id INTEGER REFERENCES product NOT NULL,
	date_buy DATE NOT NULL
);

CREATE TABLE price (
    id serial PRIMARY KEY,
    product_id INTEGER REFERENCES product NOT NULL,
	price DECIMAL(8,2) NOT NULL,
    start_working DATE NOT NULL
);

CREATE TABLE description (
    id serial PRIMARY KEY,
    product_id INTEGER REFERENCES product NOT NULL,
	property VARCHAR(255) NOT NULL,
    value VARCHAR(255) NOT NULL
);

CREATE TABLE promotion (
    id serial PRIMARY KEY,
    product_id INTEGER REFERENCES product NOT NULL,
	amount_spent DECIMAL(8,2),
    discount INTEGER NOT NULL
);

CREATE TABLE quantity_product (
	id serial PRIMARY KEY,
    shop_id INTEGER REFERENCES shop NOT NULL,
    product_id INTEGER REFERENCES product NOT NULL,
    price_id INTEGER REFERENCES price NOT NULL,
	quantity_in_stock INTEGER NOT NULL,
	quantity_in_shop INTEGER NOT NULL
);


INSERT INTO employee (name, surname, middle_name, birth_date, email, phone_number) VALUES
('Антонида','Пестова','Иванова','1980-04-11','63@yandex.ru','(907)866-30-58'),
('Вадим','Зайцев','Валентинович','1997-10-10','444@hotmail.com','(939)500-75-03'),
('Григорий','Сергеев','Иванович','1979-05-29','dfd4@hotmail.com','(995)557-39-46'),
('Ирина','Архипова','Сергеевна','1990-09-04','55@yahoo.com','(921)873-11-70'),
('Степан','Новиков','Григорьевич','1986-06-04','ccc@yandex.ru','(958)365-54-44'),
('Раиса','Михеева','Алексеевич','1981-12-08','30@ya.ru','(927)281-70-12'),
('Алёна','Гущина','Дмитриевна','1978-03-30','95@yandex.ru','(990)265-56-88'),
('Марина','Андреева','Степановна','1989-05-31','10@yahoo.com','(962)506-34-71'),
('Юлия','Федотова','Ивановна','1987-08-18','53@gmail.com','(966)494-86-12'),
('Антонида','Сидорова','Яковлевна','1979-01-02','16@hotmail.com','(913)301-17-87'),
('Владимир','Кононов','Константинович','1989-12-05','82@gmail.com','(939)628-39-66'),
('Леонид','Быков','Сергеевич','1985-04-14','h55@mail.ru','(906)073-41-42'),
('Антон','Быков','Петрович','1983-07-09','ko@gmail.com','(998)981-35-36'),
('Аркадий','Корнилов','Леонидович','1976-03-19','fl@mail.ru','(935)360-08-61'),
('Юлия','Веселова','Родионовна','1981-04-28','ti@hotmail.com','(998)118-98-71'),
('Светлана','Рябова','Константиновна','1979-04-27','88@hotmail.com','(966)566-65-58'),
('Вера','Рябова','Петровна','1978-02-10','30@gmail.com','(922)894-68-21'),
('Анна','Алексеева','Антоновна','2015-06-02','tu@mail.ru','(960)263-32-85'),
('Юрий','Орлов','Владиирович','2016-02-21','i10@gmail.com','(946)010-42-50'),
('Егор','Коновалов','Егорович','2020-08-04','8e9@yandex.ru','(998)015-60-42');

INSERT INTO supplier (name, street, house_number, email, phone_number) VALUES
('Королева','Ульянова','769','7533@mail.ru','(901)462-46-80'),
('Мясникова - Зайцев','Князева','646','pp55@yandex.ru','(938)333-31-61'),
('Рыбакова Трейд','Дмитровский проспект','740','16@mail.ru','(928)486-60-29'),
('Брагина - Морозова','Лаврентьева','152','94@gmail.com','(910)675-86-28'),
('Родионова Торг','Станиславская площадь','452','7322@mail.ru','(906)245-17-72'),
('Лаврентьева Трейд','Денисовская','455','xc@ya.ru','(927)220-76-97'),
('Данилова Пром','Матвеевская площадь','634','nz6@mail.ru','(909)588-17-06'),
('Мишина Трейд','Тарасов проспект','939','js99@mail.ru','(922)530-16-94'),
('Якорь','Кузьмина','448','79@ya.ru','(966)802-68-28'),
('Громова Трейд','Одинцова','848','969m@mail.ru','(964)710-64-93'),
('Крюкс','Одинцова','936','45@mail.ru','(941)858-85-69'),
('Анисимов Трейд','Афанасьева площадь','147','69@gmail.com','(945)650-97-62'),
('Воронова Пром','Казаков','733','tdhr@ya.ru','(991)328-22-36'),
('Бык','Матвeeвский проспект','421','8fg9@mail.ru','(970)474-76-20'),
('Журавлев Сбыт','Олеговский проспект','445','39@ya.ru','(922)717-16-39'),
('Владимиров Торг','Антонида площадь','639','ghnh90@mail.ru','(965)780-20-55'),
('Белов - Смирнова','Самсонова','6','xxzz@hotmail.com','(981)028-05-98'),
('Туров - Давыдова','Владимир пл.','925','jk9@hotmail.com','(950)635-97-66'),
('Зайцев','Натальева','614','xz93@yandex.ru','(916)630-75-56'),
('Медведев Сбыт','Данииловская','405','2@yahoo.com','(999)823-57-88');

INSERT INTO client (name, surname, middle_name, email, phone_number) VALUES
('Регина','Елисеев','Антоновна','23@ya.ru','(938)284-29-71'),
('Арсений','Белозеров','Денисович','c52@yahoo.com','(970)493-58-63'),
('Клавдия','Красильникова','Сергеевна','45@gmail.com','(980)669-51-50'),
('Владислав','Белоусов','Арсеньевич','w@yahoo.com','(915)042-47-21'),
('Любовь','Самойлова','Олеговна','.74@gmail.com','(966)890-67-37'),
('Георгий','Пахомов','Анатольевич','e@hotmail.com','(939)321-81-82'),
('Алексей','Наумов','Витальевч','.77@yandex.ru','(943)034-51-95'),
('Варвара','Мамонтова','Викторович','t@yahoo.com','(981)066-57-65'),
('Ирина','Мельникова','Егорович','y@yandex.ru','(907)015-77-65'),
('Альберт','Никонов','Егорович','10@yahoo.com','(908)033-45-07'),
('Лаврентий','Осипов','Евгеньевич','u79@hotmail.com','(985)536-65-75'),
('Дмитрий','Гусев','Романович','16@yandex.ru','(960)721-74-26'),
('Степан','Морозов','Артемьевич','31h@mail.ru','(939)239-41-43'),
('Лука','Наумов','Георгиевич','39d@yandex.ru','(955)967-37-98'),
('Ольга','Мухина','Сергеевна','7s8@yahoo.com','(939)103-62-85'),
('Леонид','Некрасов','Иванович','i@gmail.com','(991)680-24-32'),
('Галина','Шарапова','Ярославовна','o69@ya.ru','(960)275-01-66'),
('Александр','Селиверстов','Маркович','j@yahoo.com','(921)197-45-55'),
('Владимир','Кононов','Степанович','d53@yahoo.com','(985)338-95-57'),
('Егор','Шилов','Иванович','r@yahoo.com','(941)308-53-73');

INSERT INTO shop (city, street, house_number, opening_date, closing_date) VALUES
('Ялта','Жданова','98','2017-05-10',NULL),
('Новосибирск','Аллаовская','151','2016-12-27','2020-03-25'),
('Екатеринбург','Григорьевская','138','2018-07-19',NULL),
('Крива','Шилова проспект','933','2018-11-25',NULL),
('Москва','Ореховая','15','2017-09-10','2020-01-21'),
('Чебоксары','Титова','636','2018-08-30','2020-02-19'),
('Орёл','Арина площадь','572','2018-05-13',NULL),
('Тверь','Светланая','889','2019-11-01',NULL),
('Екатеринбург','Раис','417','2017-09-16',NULL),
('Владивосток','Лебедева','21','2019-05-19',NULL),
('Новосибирск','Ариная','820','2015-11-09','2020-03-10'),
('Москва','Антон проспект','408','2015-07-01','2020-02-13'),
('Воронеж','Григорий','28','2017-08-01',NULL),
('Владивосток','Тамарова','726','2020-03-16',NULL),
('Норильск','Фокина','929','2017-08-29','2019-03-23'),
('Иркутск','Валерий проспект','951','2019-05-12',NULL),
('Новосибирск','Еленовская площадь','640','2018-01-22','2019-11-15'),
('Иркутск','Анфисовская площадь','102','2016-10-04','2020-10-13'),
('Воронеж','Лаврентьева','861','2014-06-28',NULL),
('Москва','Яковлева','75','2019-02-18',NULL);

INSERT INTO department (name, creation_date) VALUES
('Детское','2015-11-21'),
('Украшения','2014-06-14'),
('Детали','2017-08-21'),
('Компьютеры','2018-11-11'),
('Инструменты','2019-11-15'),
('Игрушки','2016-12-27'),
('Фильмы','2017-04-16'),
('Мебель','2011-12-30'),
('Садинструмент','2020-10-03'),
('Технический','2016-07-01'),
('Автомобильное','2016-11-21'),
('Красота','2016-10-27'),
('Финансы','2018-05-16'),
('Спорт','2019-03-29'),
('Бакалея','2017-07-07'),
('Музыка','2018-08-16'),
('Экраны','2015-05-03'),
('Туризм','2018-06-29'),
('Промышленное','2017-05-05'),
('Ковры','2020-04-28');

INSERT INTO product (name) VALUES
('Эргономичный Гранитный Свитер'),
('Эргономичный Деревянный Свитер'),
('Фантастический Резиновый Ботинок'),
('Фантастический Резиновый Кулон'),
('Потрясающий Резиновый Кулон'),
('Фантастический Деревянный Свитер'),
('Грубый Деревянный Кулон'),
('Фантастический Деревянный Свитер'),
('Практчиный Гранитный Стол'),
('Эргономичный Хлопковый Стол'),
('Грубый Деревянный Компьютер'),
('Грубый Резиновый Ремень'),
('Невероятный Гранитный Автомобиль'),
('Грубый Пластиковый Ботинок'),
('Маленький Бетонный Берет'),
('Великолепный Резиновый Ботинок'),
('Практчиный Пластиковый Ремень'),
('Интеллектуальный Хлопковый Стул'),
('Фантастический Резиновый Берет'),
('Потрясающий Хлопковый Стул');

INSERT INTO department_unit (department_id, name, creation_date) VALUES
('17','Диски','2018-10-11'),
('14','Материалы','2018-04-27'),
('1','Инструменты','2017-07-30'),
('15','Билеты','2019-11-29'),
('19','Запчасти','2018-05-13'),
('19','Технический','2019-11-17'),
('3','Игрушки','2018-08-11'),
('11','Здоровье','2017-07-01'),
('11','Компьютеры','2018-08-15'),
('12','Электроника','2017-08-03'),
('9','Автомобильное','2019-12-18'),
('8','Украшения','2017-07-26'),
('18','Технический','2017-09-12'),
('1','Автомобильное','2019-11-23'),
('18','Книги','2019-10-04'),
('11','Здоровье','2017-07-26'),
('4','Автомобильное','2018-10-08'),
('12','Технический','2019-01-06'),
('20','Для малышей','2017-12-02'),
('18','Музыка','2019-11-25');

INSERT INTO schedule_department_unit (employee_id, department_unit_id, begin_workday, end_workday) VALUES
('13','17','2019-11-18 09:00:00','2019-11-18 18:00:00'),
('13','19','2019-11-30 09:00:00','2019-11-30 18:00:00'),
('20','11','2019-11-29 08:00:00','2019-11-29 17:00:00'),
('7','1','2019-12-18 09:00:00','2019-12-18 18:00:00'),
('4','8','2019-12-28 11:00:00','2019-12-28 20:00:00'),
('19','9','2019-12-16 09:00:00','2019-12-16 18:00:00'),
('12','3','2019-12-02 11:00:00','2019-12-02 20:00:00'),
('2','8','2019-12-07 09:00:00','2019-12-07 18:00:00'),
('10','16','2020-01-02 08:00:00','2020-01-02 18:00:00'),
('20','4','2020-01-09 09:00:00','2020-01-09 18:00:00'),
('7','1','2020-01-18 09:00:00','2020-01-18 17:00:00'),
('3','8','2020-02-17 08:00:00','2020-02-17 18:00:00'),
('20','2','2020-02-15 11:00:00','2020-02-15 20:00:00'),
('11','6','2020-02-14 11:00:00','2020-02-14 20:00:00'),
('14','8','2020-03-23 09:00:00','2020-03-23 18:00:00'),
('16','6','2020-03-27 08:00:00','2020-03-27 17:00:00'),
('16','4','2020-04-24 09:00:00','2020-04-24 17:00:00'),
('15','14','2020-04-21 08:00:00','2020-04-21 18:00:00'),
('8','4','2020-05-03 11:00:00','2020-05-03 18:00:00'),
('17','8','2020-05-17 09:00:00','2020-05-17 18:00:00');

INSERT INTO schedule_shop (employee_id, shop_id, begin_workday, end_workday) VALUES
('8','13','2019-11-18 09:00:00','2019-11-18 18:00:00'),
('16','2','2019-11-27 09:00:00','2019-11-27 17:00:00'),
('20','20','2019-11-04 11:00:00','2019-11-04 20:00:00'),
('16','1','2019-12-04 08:00:00','2019-12-04 18:00:00'),
('19','3','2019-12-09 09:00:00','2019-12-09 17:00:00'),
('11','18','2019-12-30 09:00:00','2019-12-30 18:00:00'),
('3','18','2019-12-03 08:00:00','2019-12-03 18:00:00'),
('13','12','2020-01-24 11:00:00','2020-01-24 20:00:00'),
('4','13','2020-01-25 08:00:00','2019-01-25 17:00:00'),
('12','7','2020-02-27 09:00:00','2020-02-27 18:00:00'),
('6','9','2020-02-21 09:00:00','2020-02-21 17:00:00'),
('16','10','2020-02-12 08:00:00','2020-02-12 20:00:00'),
('8','14','2020-03-17 09:00:00','2020-03-17 17:00:00'),
('4','16','2020-03-27 11:00:00','2020-03-27 18:00:00'),
('1','7','2020-03-21 08:00:00','2020-03-21 17:00:00'),
('1','14','2020-04-16 09:00:00','2020-04-16 18:00:00'),
('4','11','2020-04-03 09:00:00','2020-04-03 18:00:00'),
('4','8','2020-04-13 08:00:00','2020-04-13 20:00:00'),
('4','20','2020-05-09 11:00:00','2020-05-09 18:00:00'),
('14','18','2020-05-21 11:00:00','2020-05-21 20:00:00');

INSERT INTO shipment (employee_id, shop_id, product_id, supplier_id, price, quantity) VALUES
('14','7','7','5','682','559'),
('8','5','18','7','6901','81'),
('9','1','12','3','2664','168'),
('10','16','6','14','4393','24'),
('10','7','9','7','5271','493'),
('3','1','6','20','4146','676'),
('6','16','16','3','3720','76'),
('5','16','15','4','2431','500'),
('17','20','4','7','4038','302'),
('20','19','15','10','46','642'),
('7','3','9','19','3120','106'),
('7','3','13','3','4585','15'),
('10','3','1','12','545','75'),
('19','11','9','19','669','93'),
('20','20','5','9','376','527'),
('13','6','7','5','74','77'),
('17','17','8','17','2023','605'),
('16','8','8','4','662','714'),
('14','7','8','10','4020','685'),
('3','12','5','1','4623','2');

INSERT INTO buy (client_id, shop_id, product_id, date_buy) VALUES
('13','12','3','2015-09-21'),
('20','8','15','2020-05-15'),
('5','13','19','2016-11-13'),
('1','11','17','2018-08-17'),
('20','9','15','2019-09-19'),
('20','19','14','2018-12-23'),
('18','9','6','2020-05-26'),
('17','20','6','2020-05-27'),
('4','14','4','2020-03-28'),
('13','11','18','2019-12-30'),
('1','10','16','2018-11-01'),
('8','17','18','2020-03-04'),
('16','15','18','2017-02-09'),
('12','7','6','2016-05-01'),
('2','10','15','2018-08-06'),
('2','10','19','2019-01-04'),
('7','13','2','2018-12-03'),
('16','20','19','2019-11-23'),
('7','1','17','2018-09-30'),
('11','20','19','2017-08-26');

INSERT INTO price (product_id, price, start_working) VALUES
('3','2899','2019-02-09'),
('14','3517','2018-12-09'),
('13','388','2019-07-09'),
('16','99','2019-02-09'),
('12','6836','2018-02-09'),
('7','900','2020-06-09'),
('10','1918','2018-12-09'),
('16','7067','2020-02-09'),
('8','375','2019-07-09'),
('12','1300','2018-07-09'),
('5','254','2020-04-09'),
('2','5879','2020-04-09'),
('20','5743','2020-02-09'),
('8','1330','2018-12-09'),
('2','2929','2020-06-09'),
('17','4886','2020-04-09'),
('4','886','2020-06-09'),
('10','396','2019-12-09'),
('12','603','2020-06-09'),
('10','42','2019-07-09');

INSERT INTO description (product_id, property, value) VALUES
('10','Материал','Резиновый'),
('17','Цвет','Красно-коричневый'),
('19','Цвет','Кремовый'),
('10','Материал','Деревянный'),
('2','Цвет','Лазурный'),
('13','Цвет','Красный'),
('1','Цвет','Лиловый'),
('17','Цвет','Серый'),
('12','Цвет','Бирюзовый'),
('17','Материал','Хлопковый'),
('20','Материал','Бетонный'),
('13','Цвет','Пурпурный'),
('7','Материал','Хлопковый'),
('5','Материал','Гранитный'),
('7','Материал','Деревянный'),
('5','Цвет','Золотой'),
('11','Материал','Стальной'),
('4','Материал','Гранитный'),
('10','Цвет','Лимонный'),
('16','Материал','Пластиковый');

INSERT INTO promotion (product_id, amount_spent, discount) VALUES
('8',NULL,'5'),
('8','5000','10'),
('10',NULL,'15'),
('13','10000','20'),
('1','15000','25'),
('3',NULL,'30'),
('7','7000','35'),
('11','10000','40'),
('11',NULL,'45'),
('6',NULL,'50'),
('2','15000','55'),
('1','6000','65'),
('14',NULL,'60'),
('9','50000','50'),
('4',NULL,'55'),
('8','100000','95'),
('5','5000','75'),
('13',NULL,'80'),
('5','80000','85'),
('19','95000','90');

INSERT INTO quantity_product (shop_id, product_id, price_id, quantity_in_stock, quantity_in_shop) VALUES
('19','8','16','427','851'),
('2','12','6','633','218'),
('8','13','20','0','727'),
('4','7','12','739','879'),
('17','10','6','504','455'),
('9','4','9','373','215'),
('5','10','13','642','244'),
('15','17','11','794','0'),
('8','9','11','475','127'),
('18','18','3','229','765'),
('5','11','11','327','452'),
('20','5','10','0','539'),
('19','6','17','24','172'),
('13','14','3','588','757'),
('19','12','12','264','456'),
('19','19','11','486','313'),
('12','19','3','913','0'),
('2','11','15','821','801'),
('5','18','10','561','418'),
('1','16','14','0','414');

COMMIT;