BEGIN;

CREATE TABLE employee (
    id serial PRIY KEY,
	name VARCHAR(255),
    surname VARCHAR(255),
    middle_name VARCHAR(255),
	birth_date DATE,
    email VARCHAR(100) UNIQUE,
	phone_number VARCHAR(20) UNIQUE
)

CREATE TABLE supplier (
    id serial PRIY KEY,
    name VARCHAR(255),
    street VARCHAR(255),
    house_number INT(3),
    email VARCHAR(100) UNIQUE,
	phone_number VARCHAR(20) UNIQUE
)

CREATE TABLE client (
	id serial PRIY KEY,
	name VARCHAR(255),
    surname VARCHAR(255),
    middle_name VARCHAR(255),
    email VARCHAR(100) UNIQUE,
	phone_number VARCHAR(20) UNIQUE
)

CREATE TABLE shop (
	id serial PRIY KEY,
	city VARCHAR(255),
    street VARCHAR(255),
    house_number INT(3),
	opening_date DATE,
    closing_date DATE
)

CREATE TABLE department (
	id serial PRIY KEY,
	name VARCHAR(255),
    creation_date DATE
)

CREATE TABLE product (
    id serial PRIY KEY,
    name VARCHAR(255)
)

CREATE TABLE department_unit (
	id serial PRIY KEY,
    department_id INTEGER REFERENCES department,
	name VARCHAR(255),
    creation_date DATE
)

CREATE TABLE schedule_department_unit (
	id serial PRIY KEY,
	employee_id INTEGER REFERENCES employee,
    department_unit_id INTEGER REFERENCES department_unit,
    begin_workday TIMESTAMP,
    end_workday TIMESTAMP
)

CREATE TABLE schedule_shop (
	id serial PRIY KEY,
	employee_id INTEGER REFERENCES employee,
    shop_id INTEGER REFERENCES shop,
    begin_workday TIMESTAMP,
    end_workday TIMESTAMP
)

CREATE TABLE schedule_shop (
	id serial PRIY KEY,
	employee_id INTEGER REFERENCES employee,
    shop_id INTEGER REFERENCES shop,
    begin_workday TIMESTAMP,
    end_workday TIMESTAMP
)

CREATE TABLE shipment (
    id serial PRIY KEY,
    shop_id INTEGER REFERENCES shop,
    product_id INTEGER REFERENCES product,
    employee_id INTEGER REFERENCES employee,
    supplier_id INTEGER REFERENCES supplier,
	price EY,
    quantity INT(4)
)

CREATE TABLE buy (
	id serial PRIY KEY,
	client_id INTEGER REFERENCES client,
    shop_id INTEGER REFERENCES shop,
    product_id INTEGER REFERENCES product,
	date_buy DATE
)

CREATE TABLE price (
    id serial PRIY KEY,
    product_id INTEGER REFERENCES product,
	price EY,
    start_working DATE
)

CREATE TABLE description (
    id serial PRIY KEY,
    product_id INTEGER REFERENCES product,
	property VARCHAR(255),
    value VARCHAR(255)
)

CREATE TABLE promotion (
    id serial PRIY KEY,
    product_id INTEGER REFERENCES product,
	amount_spent EY,
    discount INT(2)
)

CREATE TABLE quantity_product (
	id serial PRIY KEY,
    shop_id INTEGER REFERENCES shop,
    product_id INTEGER REFERENCES product,
    price_id INTEGER REFERENCES price,
	quantity_in_stock INT(4),
	quantity_in_shop INT(4),
)



INSERT INTO employee (name, surname, middle_name, birth_date, email, phone_number) VALUES
('Антонида','Пестова','Иванова','04.11.1980','63@yandex.ru','(907)866-30-58')
('Вадим','Зайцев','Валентинович','10.10.1997','444@hotmail.com','(939)500-75-03')
('Григорий','Сергеев','Иванович','29.05.1979','dfd4@hotmail.com','(995)557-39-46')
('Ирина','Архипова','Сергеевна','04.09.1990','55@yahoo.com','(921)873-11-70')
('Степан','Новиков','Григорьевич','04 1986','ccc@yandex.ru','(958)365-54-44')
('Раиса','Михеева','Алексеевич','08.12.1981','30@ya.ru','(927)281-70-12')
('Алёна','Гущина','Дмитриевна','30.03.1978','95@yandex.ru','(990)265-56-88')
('Марина','Андреева','Степановна','31.05.1989','10@yahoo.com','(962)506-34-71')
('Юлия','Федотова','Ивановна','18.08.1987','53@gmail.com','(966)494-86-12')
('Антонида','Сидорова','Яковлевна','22.01.1979','16@hotmail.com','(913)301-17-87')
('Владимир','Кононов','Константинович','05.12.1989','82@gmail.com','(939)628-39-66')
('Леонид','Быков','Сергеевич','14.04.1985','h55@mail.ru','(906)073-41-42')
('Антон','Быков','Петрович','09.07.1983','ko@gmail.com','(998)981-35-36')
('Аркадий','Корнилов','Леонидович','19.03.1976','fl@mail.ru','(935)360-08-61')
('Юлия','Веселова','Родионовна','28.04.1981','ti@hotmail.com','(998)118-98-71')
('Светлана','Рябова','Константиновна','25.09.1987','88@hotmail.com','(966)566-65-58')
('Вера','Рябова','Петровна','10.02.1978','30@gmail.com','(922)894-68-21')
('Анна','Алексеева','Антоновна','02.06.2015','tu@mail.ru','(960)263-32-85')
('Юрий','Орлов','Владиирович','21.11.2016','i10@gmail.com','(946)010-42-50')
('Егор','Коновалов','Егорович','04.08.2020','8e9@yandex.ru','(998)015-60-42')

INSERT INTO supplier (name, street, house_number, email, phone_number) VALUES
('Королева','Ульянова','769','7533@mail.ru','(901)462-46-80')
('Мясникова - Зайцев','Князева','646','pp55@yandex.ru','(938)333-31-61')
('Рыбакова Трейд','Дмитровский проспект','740','16@mail.ru','(928)486-60-29')
('Брагина - Морозова','Лаврентьева','152','94@gmail.com','(910)675-86-28')
('Родионова Торг','Станиславская площадь','452','7322@mail.ru','(906)245-17-72')
('Лаврентьева Трейд','Денисовская','455','xc@ya.ru','(927)220-76-97')
('Данилова Пром','Матвеевская площадь','634','nz6@mail.ru','(909)588-17-06')
('Мишина Трейд','Тарасов проспект','939','js99@mail.ru','(922)530-16-94')
('Якорь','Кузьмина','448','79@ya.ru','(966)802-68-28')
('Громова Трейд','Одинцова','848','969m@mail.ru','(964)710-64-93')
('Крюкс','Одинцова','936','45@mail.ru','(941)858-85-69')
('Анисимов Трейд','Афанасьева площадь','147','69@gmail.com','(945)650-97-62')
('Воронова Пром','Казаков','733','tdhr@ya.ru','(991)328-22-36')
('Бык','Матвeeвский проспект','421','8fg9@mail.ru','(970)474-76-20')
('Журавлев Сбыт','Олеговский проспект','445','39@ya.ru','(922)717-16-39')
('Владимиров Торг','Антонида площадь','639','ghnh90@mail.ru','(965)780-20-55')
('Белов - Смирнова','Самсонова','6','xxzz@hotmail.com','(981)028-05-98')
('Туров - Давыдова','Владимир пл.','925','jk9@hotmail.com','(950)635-97-66')
('Зайцев','Натальева','614','xz93@yandex.ru','(916)630-75-56')
('Медведев Сбыт','Данииловская','405','2@yahoo.com','(999)823-57-88')

INSERT INTO client (name, surname, middle_name, email, phone_number) VALUES
('Регина','Елисеев','Антоновна','23@ya.ru','(938)284-29-71')
('Арсений','Белозеров','Денисович','c52@yahoo.com','(970)493-58-63')
('Клавдия','Красильникова','Сергеевна','45@gmail.com','(980)669-51-50')
('Владислав','Белоусов','Арсеньевич','w@yahoo.com','(915)042-47-21')
('Любовь','Самойлова','Олеговна','.74@gmail.com','(966)890-67-37')
('Георгий','Пахомов','Анатольевич','e@hotmail.com','(939)321-81-82')
('Алексей','Наумов','Витальевч','.77@yandex.ru','(943)034-51-95')
('Варвара','Мамонтова','Викторович','t@yahoo.com','(981)066-57-65')
('Ирина','Мельникова','Егорович','y@yandex.ru','(907)015-77-65')
('Альберт','Никонов','Егорович','10@yahoo.com','(908)033-45-07')
('Лаврентий','Осипов','Евгеньевич','u79@hotmail.com','(985)536-65-75')
('Дмитрий','Гусев','Романович','16@yandex.ru','(960)721-74-26')
('Степан','Морозов','Артемьевич','31h@mail.ru','(939)239-41-43')
('Лука','Наумов','Георгиевич','39d@yandex.ru','(955)967-37-98')
('Ольга','Мухина','Сергеевна','7s8@yahoo.com','(939)103-62-85')
('Леонид','Некрасов','Иванович','i@gmail.com','(991)680-24-32')
('Галина','Шарапова','Ярославовна','o69@ya.ru','(960)275-01-66')
('Александр','Селиверстов','Маркович','j@yahoo.com','(921)197-45-55')
('Владимир','Кононов','Степанович','d53@yahoo.com','(985)338-95-57')
('Егор','Шилов','Иванович','r@yahoo.com','(941)308-53-73')

INSERT INTO shop (city, street, house_number, opening_date, closing_date) VALUES
('Ялта','Жданова','98','10.05.2017',null)
('Новосибирск','Аллаовская','151','27.12.2016','25.03.2020')
('Екатеринбург','Григорьевская','138','19.07.2018',null)
('Крива','Шилова проспект','933','31.11.2019',null)
('Москва','Ореховая','15','10.09.2017','29.01.2020')
('Чебоксары','Титова','636','30.08.2018','19.02.2020')
('Орёл','Арина площадь','572','13.05.2018',null)
('Тверь','Светланая','889','01.11.2019',null)
('Екатеринбург','Раис','417','16.09.2017',null)
('Владивосток','Лебедева','21','29.05.2019',null)
('Новосибирск','Ариная','820','09.11.2015','11.03.2020')
('Москва','Антон проспект','408','01.07.2016','13.02.2020')
('Воронеж','Григорий','28','01.08.2017',null)
('Владивосток','Тамарова','726','16.03.2020',null)
('Норильск','Фокина','929','29.08.2017','23.03.2019')
('Иркутск','Валерий проспект','951','12.05.2019',null)
('Новосибирск','Еленовская площадь','640','22.01.2018','15.11.2019')
('Иркутск','Анфисовская площадь','102','04.10.2016','13.10.2020')
('Воронеж','Лаврентьева','861','28.06.2014',null)
('Москва','Яковлева','75','18.02.2019',null)

INSERT INTO department (name, creation_date) VALUES
('Детское','21.11.2015')
('Украшения','14.06.2014')
('Детали','21.08.2017')
('Компьютеры','11.11.2018')
('Инструменты','15.11.2019')
('Игрушки','27.12.2016')
('Фильмы','01.08.2017')
('Мебель','30.12.2011')
('Садинструмент','07.10.2020')
('Технический','01.07.2016')
('Автомобильное','21.11.2016')
('Красота','27.10.2016')
('Финансы','16.05.2018')
('Спорт','29.03.2019')
('Бакалея','09.07.2017')
('Музыка','16.08.2018')
('Экраны','03.05.2015')
('Туризм','29.06.2018')
('Промышленное','05.05.2017')
('Ковры','28.04.2020')

INSERT INTO product (name) VALUES
('Эргономичный Гранитный Свитер')
('Эргономичный Деревянный Свитер')
('Фантастический Резиновый Ботинок')
('Фантастический Резиновый Кулон')
('Потрясающий Резиновый Кулон')
('Фантастический Деревянный Свитер')
('Грубый Деревянный Кулон')
('Фантастический Деревянный Свитер')
('Практчиный Гранитный Стол')
('Эргономичный Хлопковый Стол')
('Грубый Деревянный Компьютер')
('Грубый Резиновый Ремень')
('Невероятный Гранитный Автомобиль')
('Грубый Пластиковый Ботинок')
('Маленький Бетонный Берет')
('Великолепный Резиновый Ботинок')
('Практчиный Пластиковый Ремень')
('Интеллектуальный Хлопковый Стул')
('Фантастический Резиновый Берет')
('Потрясающий Хлопковый Стул')

INSERT INTO department_unit (department_id, name, creation_date) VALUES
('17','Диски','11.10.2018')
('14','Материалы','27.04.2018')
('0','Инструменты','30.07.2017')
('15','Билеты','29.11.2019')
('19','Запчасти','13.05.2018')
('19','Технический','17.11.2019')
('3','Игрушки','11.08.2018')
('11','Здоровье','01.07.2017')
('11','Компьютеры','05.08.2018')
('12','Электроника','03.08.2017')
('9','Автомобильное','18.12.2019')
('8','Украшения','26.07.2017')
('18','Технический','21.09.2017')
('0','Автомобильное','23.11.2019')
('18','Книги','04.10.2019')
('11','Здоровье','26.07.2017')
('4','Автомобильное','10.08.2018')
('12','Технический','06.01.2019')
('20','Для малышей','02.12.2017')
('18','Музыка','25.11.2019')

INSERT INTO schedule_department_unit (employee_id, department_unit_id, begin_workday, end_workday) VALUES
('13','17','30 2020 11:49:26 GMT+0300 (GMT+03:00)','Mon Mar 16 2020 03:10:10 GMT+0300 (GMT+03:00)')
('13','19','27 2019 08:24:12 GMT+0300 (GMT+03:00)','Fri Nov 22 2019 08:38:42 GMT+0300 (GMT+03:00)')
('20','11','Sun Aug 25 2019 13:45:51 GMT+0300 (GMT+03:00)','Tue Apr 14 2020 07:26:36 GMT+0300 (GMT+03:00)')
('7','1','Sun Mar 08 2020 03:44:04 GMT+0300 (GMT+03:00)','Mon May 27 2019 08:51:45 GMT+0300 (GMT+03:00)') 
('4','5','Sat Oct 12 2019 17:03:50 GMT+0300 (GMT+03:00)','Tue Jul 30 2019 03:57:01 GMT+0300 (GMT+03:00)')
('19','9','Thu Jan 09 2020 19:25:32 GMT+0300 (GMT+03:00)','Tue Mar 24 2020 06:04:37 GMT+0300 (GMT+03:00)')
('12','3','Fri Nov 15 2019 10:22:22 GMT+0300 (GMT+03:00)','Thu Nov 21 2019 23:13:55 GMT+0300 (GMT+03:00)')
('2','5','Tue Mar 17 2020 14:44:29 GMT+0300 (GMT+03:00)','Thu Aug 15 2019 14:40:52 GMT+0300 (GMT+03:00)') 
('10','16','Sun Jul 28 2019 12:04:31 GMT+0300 (GMT+03:00)','Tue Jul 16 2019 12:30:25 GMT+0300 (GMT+03:00)')
('20','4','Sat May 25 2019 15:00:57 GMT+0300 (GMT+03:00)','Tue Jun 04 2019 18:15:46 GMT+0300 (GMT+03:00)')
('7','1','Tue Sep 03 2019 13:50:22 GMT+0300 (GMT+03:00)','Sun Feb 23 2020 18:17:42 GMT+0300 (GMT+03:00)') 
('0','5','Sun Jun 30 2019 01:14:48 GMT+0300 (GMT+03:00)','Sun Sep 01 2019 08:10:20 GMT+0300 (GMT+03:00)') 
('20','2','Thu Dec 05 2019 06:13:23 GMT+0300 (GMT+03:00)','Tue May 19 2020 23:34:07 GMT+0300 (GMT+03:00)')
('11','6','Sun Aug 11 2019 13:57:32 GMT+0300 (GMT+03:00)','Wed Sep 25 2019 11:24:08 GMT+0300 (GMT+03:00)')
('0','8','Mon Nov 04 2019 03:33:02 GMT+0300 (GMT+03:00)','Tue Jul 23 2019 12:11:40 GMT+0300 (GMT+03:00)')
('16','6','Sun Feb 16 2020 12:03:26 GMT+0300 (GMT+03:00)','Sun Dec 15 2019 02:04:27 GMT+0300 (GMT+03:00)')
('16','4','Wed Aug 21 2019 03:13:52 GMT+0300 (GMT+03:00)','Wed Jan 08 2020 02:24:12 GMT+0300 (GMT+03:00)')
('15','14','Fri Mar 06 2020 07:26:31 GMT+0300 (GMT+03:00)','Tue Jan 14 2020 14:16:23 GMT+0300 (GMT+03:00)')
('8','4','Tue Mar 24 2020 15:58:05 GMT+0300 (GMT+03:00)','Fri May 31 2019 09:50:01 GMT+0300 (GMT+03:00)') 
('17','5','Sat Jan 11 2020 17:25:25 GMT+0300 (GMT+03:00)','Sun Aug 25 2019 17:44:51 GMT+0300 (GMT+03:00)')





INSERT INTO quantity_product (shop_id, product_id, price_id, quantity_in_stock, quantity_in_shop) VALUES
('19','1','3','104','816')
('20','15','9','255','46')
('15','20','19','857','32')
('7','20','11','598','207')
('16','11','13','761','915')
('15','4','1','526','608')
('7','5','8','596','152')
('14','13','13','230','129')
('19','3','13','338','888')
('12','11','13','781','983')
('16','6','3','904','465')
('6','17','3','882','402')
('4','3','15','684','523')
('18','7','15','307','248')
('14','17','4','467','261')
('9','18','8','813','97')
('19','15','12','786','620')
('15','14','10','3','51')
('7','19','18','571','431')
('13','7','1','747','38')


COMMIT;
end
